fonecmid-diplom/src/Documents/ВКМ_ГрафикОтпусков/ВКМ_ГрафикОтпусков.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Document>
  <name>ВКМ_ГрафикОтпусков</name>
  <registerRecords>AccumulationRegister.ВКМ_ПлановыеОтпуска</registerRecords>
  <attributes>
    <name>Комментарий</name>
    <type>
      <types>String</types>
    </type>
  </attributes>
  <attributes>
    <name>Год</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>4</precision>
      </numberQualifiers>
    </type>
  </attributes>
  <tabularSections>
    <name>ОтпускаСотрудников</name>
    <attributes>
      <name>Сотрудник</name>
      <type>
        <types>CatalogRef.ВКМ_Сотрудники</types>
      </type>
    </attributes>
    <attributes>
      <name>ДатаНачала</name>
      <type>
        <types>Date</types>
        <dateQualifiers>
          <dateFractions>Date</dateFractions>
        </dateQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>ДатаОкончания</name>
      <type>
        <types>Date</types>
        <dateQualifiers>
          <dateFractions>Date</dateFractions>
        </dateQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>Более28Дней</name>
      <type>
        <types>Boolean</types>
      </type>
    </attributes>
  </tabularSections>
</mdclass:Document>

fonecmid-diplom/src/Documents/ВКМ_ГрафикОтпусков/Forms/ФормаДокумента/Module.bsl
#Область ОбработчикиСобытийФормы

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
//++Симбирёва О.С 02.07.26

	ПересчитатьВсеПризнакиНасервере();
	
//--Симбирёва О.С 02.07.26

КонецПроцедуры

#КонецОбласти

#Область ОбработчикиСобытийЭлементовТаблицыФормыОтпускаСотрудников

&НаКлиенте
Процедура ОтпускаСотрудниковПриОкончанииРедактирования(Элемент, НоваяСтрока, ОтменаРедактирования)
	
//++Симбирёва О.С 02.07.26	

	ПересчитатьВсеПризнакиНасервере();
	Элементы.ОтпускаСотрудников.Обновить();
	
//--Симбирёва О.С 02.07.26
	
КонецПроцедуры

#КонецОбласти

#Область ОбработчикиКомандФормы

&НаКлиенте
Процедура График(Команда)
	
//++Симбирёва О.С 02.07.26
	
	АдресВременногоХранилища = ГрафикНаСервере();
	
	ПараметрыФормы = Новый Структура;
	ПараметрыФормы.Вставить("АдресВременногоХранилища", АдресВременногоХранилища);
	
	ОткрытьФорму("Документ.ВКМ_ГрафикОтпусков.Форма.АнализГрафика", ПараметрыФормы, ЭтотОбъект);

//--Симбирёва О.С 02.07.26
	
КонецПроцедуры

#КонецОбласти
	
#Область СлужебныеПроцедурыИФункции

&НаСервере
Процедура ПересчитатьВсеПризнакиНасервере()
	
//++Симбирёва О.С 02.07.26
	
	ДокументОбъект = РеквизитФормыВЗначение("Объект");

	Если ДокументОбъект.ОтпускаСотрудников.Количество() = 0 Тогда
		Возврат;
	КонецЕсли;
	
	ДниПоСотрудникам = Новый Соответствие;
	
	Для Каждого Строка Из ДокументОбъект.ОтпускаСотрудников Цикл
		
		КоличествоДней = (Строка.ДатаОкончания - Строка.ДатаНачала) / 86400 + 1;
		
		ТекущиеДни = ДниПоСотрудникам.Получить(Строка.Сотрудник);
		
		Если ТекущиеДни = Неопределено Тогда
			ДниПоСотрудникам.Вставить(Строка.Сотрудник, КоличествоДней);
		Иначе
			ДниПоСотрудникам.Вставить(Строка.Сотрудник, ТекущиеДни + КоличествоДней);
		КонецЕсли;
		
	КонецЦикла;
	
	Для Каждого Строка Из ДокументОбъект.ОтпускаСотрудников Цикл
		
		ВсегоДней = ДниПоСотрудникам.Получить(Строка.Сотрудник);
		
		Если ВсегоДней = Неопределено Тогда
			ВсегоДней = 0;
		КонецЕсли;
		
		Строка.Более28Дней = (ВсегоДней > 28);
		
	КонецЦикла;
	
	ЗначениеВРеквизитФормы(ДокументОбъект,"Объект");
	
//--Симбирёва О.С 02.07.26
	
КонецПроцедуры


&НаСервере
Функция ГрафикНаСервере()
	
//++Симбирёва О.С 02.07.26
	
	ДокументОбъект = РеквизитФормыВЗначение("Объект");
	
	ДанныеСотрудников = ДокументОбъект.ОтпускаСотрудников; 
	ПередаваемыеДанные = Новый Массив;
	
	Для Каждого Данные Из ДанныеСотрудников Цикл
		
		ДанныеДляПередачи = Новый Структура;
		ДанныеДляПередачи.Вставить("Сотрудник", Данные.Сотрудник.Наименование);
		ДанныеДляПередачи.Вставить("ДатаНачала", Данные.ДатаНачала);
		ДанныеДляПередачи.Вставить("ДатаОкончания", Данные.ДатаОкончания);
		ДанныеДляПередачи.Вставить("ВидРасчета", "Отпуск");  
		
		ПередаваемыеДанные.Добавить(ДанныеДляПередачи);
		
	КонецЦикла;
	
	АдресВременногоХранилища = ПоместитьВоВременноеХранилище(ПередаваемыеДанные, Новый УникальныйИдентификатор);
	
	Возврат АдресВременногоХранилища;
	
//--Симбирёва О.С 02.07.26
	
КонецФункции


#КонецОбласти
